<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Table Columns
    |--------------------------------------------------------------------------
    */

    'column.name' => 'الاسم',
    'column.guard_name' => 'اسم الـ Guard',
    'column.roles' => 'الأدوار',
    'column.permissions' => 'الصلاحيات',
    'column.updated_at' => 'تاريخ التحديث',
    'column.team' => 'الفريق',

    /*
    |--------------------------------------------------------------------------
    | Form Fields
    |--------------------------------------------------------------------------
    */

    'field.name' => 'اسم الدور',
    'field.guard_name' => 'اسم الـ Guard',
    'field.permissions' => 'الصلاحيات',
    'field.select_all.name' => 'تحديد الكل',
    'field.select_all.message' => 'تفعيل جميع الصلاحيات لهذا الدور',
    'field.team' => 'الفريق',
    'field.team.placeholder' => 'اختر فريقاً...',

    /*
    |--------------------------------------------------------------------------
    | Navigation & Resource
    |--------------------------------------------------------------------------
    */

    'nav.group' => 'إدارة الصلاحيات',
    'nav.role.label' => 'الأدوار',
    'nav.role.icon' => 'heroicon-o-shield-check',
    'resource.label.role' => 'دور',
    'resource.label.roles' => 'الأدوار',

    /*
    |--------------------------------------------------------------------------
    | Section & Tabs
    |--------------------------------------------------------------------------
    */

    'section' => 'الأقسام',
    'resources' => 'الموارد',
    'widgets' => 'الودجتات',
    'pages' => 'الصفحات',
    'custom' => 'صلاحيات مخصصة',

    /*
    |--------------------------------------------------------------------------
    | Messages
    |--------------------------------------------------------------------------
    */

    'forbidden' => 'غير مصرح لك بالوصول إلى هذه الصفحة.',

    /*
    |--------------------------------------------------------------------------
    | Resource Permissions' Labels
    |--------------------------------------------------------------------------
    */

    'resource_permission_prefixes_labels' => [
        'view' => 'عرض',
        'view_any' => 'عرض القائمة',
        'create' => 'إنشاء',
        'update' => 'تعديل',
        'delete' => 'حذف',
        'delete_any' => 'حذف متعدد',
        'force_delete' => 'حذف نهائي',
        'force_delete_any' => 'حذف نهائي متعدد',
        'reorder' => 'إعادة ترتيب',
        'restore' => 'استعادة',
        'restore_any' => 'استعادة متعددة',
        'replicate' => 'نسخ',
    ],
];